InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/ESP-Now_ESP32-S3_Remote-Side-01/src/main.cpp
  // Clamp hasil ke range valid (double check)
  if (duty < 205) duty = 205;  // Min duty untuk 1000 Âµs
  if (duty > 410) duty = 410;  // Max duty untuk 2000 Âµs
  
  return duty;
}

static float wrapHeadingError(float setpointDeg, float currentDeg) {
  float err = setpointDeg - currentDeg;
  while (err > 180.0f) err -= 360.0f;
  while (err < -180.0f) err += 360.0f;
  return err;
}

static float bearingDeg(double lat1, double lon1, double lat2, double lon2) {
  const double dLon = (lon2 - lon1) * (M_PI / 180.0);
  const double lat1r = lat1 * (M_PI / 180.0);
  const double lat2r = lat2 * (M_PI / 180.0);
  const double y = sin(dLon) * cos(lat2r);
  const double x = cos(lat1r) * sin(lat2r) - sin(lat1r) * cos(lat2r) * cos(dLon);
  float brng = (float)(atan2(y, x) * (180.0 / M_PI));
  brng = fmodf(brng + 360.0f, 360.0f);
  return brng;
}

static float distanceM(double lat1, double lon1, double lat2, double lon2) {
  const double R = 6371000.0;
  const double lat1r = lat1 * (M_PI / 180.0);
  const double lat2r = lat2 * (M_PI / 180.0);
  const double dLat = lat2r - lat1r;
  const double dLon = (lon2 - lon1) * (M_PI / 180.0);
  const double a = sin(dLat / 2.0) * sin(dLat / 2.0)
                 + cos(lat1r) * cos(lat2r) * sin(dLon / 2.0) * sin(dLon / 2.0);
  const double c = 2.0 * atan2(sqrt(a), sqrt(1.0 - a));
  return (float)(R * c);
}

/**
 * @brief Mode Manual - Kontrol rudder langsung dari receiver RC (CH1)
 */
void rudder_manual() {
  servo_angle_current_offset = mapFloat(controlInput.rudder, 1000, 1992, -40.0f, 40.0f);
  servo_angle_current_offset = constrain(servo_angle_current_offset, -40.0f, 40.0f);

  float calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
  servo_duty = angleToDuty(calculated_angle);
  ledcWrite(SERVO_RUDDER_pin, servo_duty);

  dataToSend.heading_setpoint = dataToSend.yaw;
  dataToSend.heading_error = 0;
  dataToSend.rudder_cmd = (int16_t)(servo_angle_current_offset * 100.0f);
  dataToSend.track_wp_index = 0;
  dataToSend.distance_to_wp = 0;
}

void rudder_hold_neutral() {
  servo_angle_current_offset = 0.0f;
  servo_duty = angleToDuty(REFERENCE_ANGLE);
  ledcWrite(SERVO_RUDDER_pin, servo_duty);
  dataToSend.rudder_cmd = 0;
}

void auto_track() {
  const float yaw_deg = dataToSend.yaw / 100.0f;

  if (!g_hasWaypoints) {
    rudder_hold_neutral();
    dataToSend.heading_setpoint = dataToSend.yaw;
    dataToSend.heading_error = 0;
    dataToSend.track_wp_index = 0;
    dataToSend.distance_to_wp = 0;
    return;
  }

  double tgt_lat = 0.0;
  double tgt_lon = 0.0;
  uint8_t wp_index_field = 0;

  if (g_lastWaypoints.wp_count > 0) {
    uint8_t idx = g_active_wp_index;
    if (idx >= g_lastWaypoints.wp_count) {
      idx = g_lastWaypoints.wp_count - 1;
    }
    tgt_lat = g_lastWaypoints.wp_lat[idx];
    tgt_lon = g_lastWaypoints.wp_lon[idx];
    wp_index_field = idx + 1;
  } else if (g_lastWaypoints.home_valid) {
    tgt_lat = g_lastWaypoints.home_lat;
    tgt_lon = g_lastWaypoints.home_lon;
    wp_index_field = 255;
  } else {
    rudder_hold_neutral();
    dataToSend.heading_setpoint = dataToSend.yaw;
    dataToSend.heading_error = 0;
    dataToSend.track_wp_index = 0;
    dataToSend.distance_to_wp = 0;
    return;
  }

  const float bearing = bearingDeg(dataToSend.latitude, dataToSend.longitude, tgt_lat, tgt_lon);
  const float dist_m = distanceM(dataToSend.latitude, dataToSend.longitude, tgt_lat, tgt_lon);
  const float err = wrapHeadingError(bearing, yaw_deg);

  // TODO: PID rudder_cmd dari heading_error (+ gyro) — sementara hold netral
  rudder_hold_neutral();

  dataToSend.heading_setpoint = (uint16_t)(bearing * 100.0f);
  dataToSend.heading_error = (int16_t)(err * 100.0f);
  dataToSend.track_wp_index = wp_index_field;
  dataToSend.distance_to_wp = (uint16_t)(dist_m * 10.0f);
}

void check_mode_auto_manual(uint16_t modeautomanual) {
  if (modeautomanual >= 1750) {
    auto_track();
    dataToSend.mode_auto = 1;
  } else {
    rudder_manual();
    dataToSend.mode_auto = 0;
  }
}

/**
 * @brief Setup function - Inisialisasi semua hardware dan komunikasi
 * 
 * @details
 * Function ini melakukan inisialisasi:
 * 1. Serial Monitor (115200 baud)
 * 2. PPM interrupt handler untuk receiver RC
 * 3. Pulse counter interrupt untuk rotary encoder
 * 4. ADC configuration untuk feedback dan battery monitoring
 * 5. Servo PWM configuration (rudder, propeller speed/direction)
 * 6. GNSS module (u-blox GPS) via Serial1
 * 7. IMU (HWT905TTL) via Serial2
 * 8. ESP-NOW untuk wireless communication
 * 
 * @note
 * - Semua interrupt handler harus dideklarasikan dengan IRAM_ATTR
 * - ADC2 tidak dapat digunakan saat WiFi aktif (gunakan ADC1 saja)
 * - GNSS akan dikonfigurasi ke 115200 baud dan 10 Hz update rate
 */
void setup() {
    // ========== Serial Monitor Initialization ==========
    Serial.begin(115200);
    delay(500);
    
    // ========== PPM Interrupt Setup ==========
    pinMode(PPM_PIN, INPUT);
    attachInterrupt(digitalPinToInterrupt(PPM_PIN), ppm_interrupt_handler, CHANGE);
    
    // Setup Pulse Counter for Motor Prop 1
    pinMode(PULSE_PIN_Motor_prop_1, INPUT);
    attachInterrupt(digitalPinToInterrupt(PULSE_PIN_Motor_prop_1), pulse_interrupt_handler_motor_prop_1, RISING);
    
    // Setup Pulse Counter for Motor Prop 2
    pinMode(PULSE_PIN_Motor_prop_2, INPUT);
    attachInterrupt(digitalPinToInterrupt(PULSE_PIN_Motor_prop_2), pulse_interrupt_handler_motor_prop_2, RISING);
    
    // Configure ADC settings
    analogReadResolution(12);     

    bool attach_PWM_pin = ledcAttachChannel(SERVO_RUDDER_pin, SERVO_RUDDER_freq, SERVO_RUDDER_resolution, 0);
    if (attach_PWM_pin) {
      Serial.println("Servo Rudder attached to pin 5");
    } else {
      Serial.println("Failed to attach servo rudder");
    }

    // Setup LEDC untuk Propeller Speed
    bool attach_prop_speed = ledcAttachChannel(PROP_SPEED_pin, PROP_SPEED_freq, PROP_SPEED_resolution, 2);
    if (attach_prop_speed) {
      Serial.println("Propeller Speed attached to pin 6 (LEDC)");
    } else {
      Serial.println("Failed to attach propeller speed");
    }

    // Setup LEDC untuk Propeller Direction
    bool attach_prop_dir = ledcAttachChannel(PROP_DIRECTION_pin, PROP_DIRECTION_freq, PROP_DIRECTION_resolution, 1);
    if (attach_prop_dir) {
      Serial.println("Propeller Direction attached to pin 7 (LEDC)");
    } else {
      Serial.println("Failed to attach propeller direction");
    }
    // Note: servoPropSpeed dan servoPropDirection tidak digunakan lagi, sudah diganti dengan LEDC

    delay(1000);
    Serial.println("PPM Reader initialized - Reading FS-iA6B on pin 4");

      // Start Serial 2 with the defined RX and TX pins and a baud rate of 9600
    gpsSerial.begin(GPS_BAUD, SERIAL_8N1, RXD1, TXD1);
    Serial.println("Serial 2 started at 9600 baud rate");

    // 1) Set u-blox UART1 baud to 115200 at current link speed (9600)
    delay(200);
    setUbxUartBaud(115200);
    delay(200);
    // 2) Switch ESP32 UART to 115200 to match the module
  #if ARDUINO_USB_CDC_ON_BOOT
    // ensure buffered data is flushed before changing baud
  #endif
    gpsSerial.flush();
    // Prefer updateBaudRate if available; fallback to end/begin
  #if defined(HW_SERIAL_HAS_UPDATEBAUDRATE)
    gpsSerial.updateBaudRate(115200);
  #else
    gpsSerial.end();
    delay(50);
    gpsSerial.begin(115200, SERIAL_8N1, RXD1, TXD1);
  #endif
    Serial.println("GPS UART switched to 115200");

    // 3) Now set 10 Hz update rate at the new baud
    delay(200);
    setUbxMeasurementRate(100); // 100 ms = 10 Hz

    // 4) Persist configuration to BBR and Flash (if supported)
    delay(200);
    saveUbxConfig(true, true);

    // setting for hwt905ttl serial port
    HWT905TTL_Serial.begin(HWT905TTL_BAUD, SERIAL_8N1, RXD2, TXD2);

        // Set device as a Wi-Fi Station
    WiFi.mode(WIFI_STA);

    // Init ESP-NOW
    if (esp_now_init() != ESP_OK) {
      Serial.println("Error initializing ESP-NOW");
      return;
    }

    // Once ESPNow is successfully Init, we will register for Send CB to
    // get the status of Trasnmitted packet
    // esp_now_register_send_cb(OnDataSent);
    
    // Register peer
    memcpy(peerInfo.peer_addr, user_side_Address, 6);
    peerInfo.channel = 0;  
    peerInfo.encrypt = false;
    
    // Add peer        
    if (esp_now_add_peer(&peerInfo) != ESP_OK){
      Serial.println("Failed to add peer");
      return;
    }

