InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/ESP-Now_ESP32-S3_Remote-Side-01/src/main.cpp
        // Add to moving average buffer (circular buffer)
        pulse_buffer_motor_prop_1[buffer_index_motor_prop_1] = pulses_per_loop_motor_prop_1;
        buffer_index_motor_prop_1 = (buffer_index_motor_prop_1 + 1) % RPM_SAMPLES_motor_prop_1;  // Circular index
        
        // Calculate moving average
        uint32_t pulse_sum_motor_prop_1 = 0;
        for (uint8_t i = 0; i < RPM_SAMPLES_motor_prop_1; i++) {
            pulse_sum_motor_prop_1 += pulse_buffer_motor_prop_1[i];
        }
        float avg_pulses_per_loop_motor_prop_1 = pulse_sum_motor_prop_1 / (float)RPM_SAMPLES_motor_prop_1;
        
        // Calculate RPM and cast directly to uint16_t (PPR = 1, loop interval = 100ms = 0.1s)
        // RPM = (avg_pulses_per_loop / 0.1s) * 60 = avg_pulses_per_loop * 600
        dataToSend.rpm_prop_1 = (uint16_t)(avg_pulses_per_loop_motor_prop_1 * 600.0);  //rpm motor propeller 1
        
        // ========== Calculate RPM for Motor Prop 2 ==========
        // Calculate pulses per loop (100ms) using delta method
        static uint32_t previous_pulse_counter_motor_prop_2 = 0;
        uint32_t pulses_per_loop_motor_prop_2 = pulse_counter_motor_prop_2 - previous_pulse_counter_motor_prop_2;
        previous_pulse_counter_motor_prop_2 = pulse_counter_motor_prop_2;
        
        // Add to moving average buffer (circular buffer)
        pulse_buffer_motor_prop_2[buffer_index_motor_prop_2] = pulses_per_loop_motor_prop_2;
        buffer_index_motor_prop_2 = (buffer_index_motor_prop_2 + 1) % RPM_SAMPLES_motor_prop_2;  // Circular index
        
        // Calculate moving average
        uint32_t pulse_sum_motor_prop_2 = 0;
        for (uint8_t i = 0; i < RPM_SAMPLES_motor_prop_2; i++) {
            pulse_sum_motor_prop_2 += pulse_buffer_motor_prop_2[i];
        }
        float avg_pulses_per_loop_motor_prop_2 = pulse_sum_motor_prop_2 / (float)RPM_SAMPLES_motor_prop_2;
        
        // Calculate RPM and cast directly to uint16_t (PPR = 1, loop interval = 100ms = 0.1s)
        // RPM = (avg_pulses_per_loop / 0.1s) * 60 = avg_pulses_per_loop * 600
        dataToSend.rpm_prop_2 = (uint16_t)(avg_pulses_per_loop_motor_prop_2 * 600.0);  //rpm motor propeller 2
        
        // Print RPM motor prop 1 and 2
        // Serial.print("RPM_prop_1: ");
        // Serial.print(dataToSend.rpm_prop_1);
        // Serial.print(" | RPM_prop_2: ");
        // Serial.print(dataToSend.rpm_prop_2);
        // Serial.print(" | Total_pulses_1: ");
        // Serial.print(pulse_counter_motor_prop_1);
        // Serial.print(" | Total_pulses_2: ");
        // Serial.println(pulse_counter_motor_prop_2); 

        // Baca ADC dalam miliVolt dari GPIO1 (ADC1_CH0)
        uint32_t adc_millivolts_batt_1 = analogReadMilliVolts(ADC_PIN_BATT_1);
        // Konversi mV ke V, lalu kalikan dengan faktor skala 5 (voltage divider)
        float volt_batt_1 = (adc_millivolts_batt_1 / 1000.0) * 5.0;
        // Konversi ke uint16_t (Ã— 100) untuk pengiriman
        dataToSend.battery_1 = (uint16_t)(volt_batt_1 * 100); // batere for ESP32-S3, Servo, HWT905TTL, Receiver RC, GNSS, Rotary Encoder
        
        // Baca ADC dalam miliVolt dari GPIO2 (ADC1_CH1)
        uint32_t adc_millivolts_batt_2 = analogReadMilliVolts(ADC_PIN_BATT_2);
        // Konversi mV ke V, lalu kalikan dengan faktor skala 5 (voltage divider)
        float volt_batt_2 = (adc_millivolts_batt_2 / 1000.0) * 5.0;
        // Konversi ke uint16_t (Ã— 100) untuk pengiriman
        dataToSend.battery_2 = (uint16_t)(volt_batt_2 * 100); // batere for motor propeller

        // ========== Serial Print Debugging ==========
        Serial.print(dataToSend.timestamp, 3); Serial.println("");
        // Serial.print(dataToSend.latitude, 6); Serial.println(""); //Serial.print(",");
        // Serial.print(dataToSend.longitude, 6); Serial.print(",");
        // Serial.print(dataToSend.speedMps / 100.0, 2); Serial.print(",");
        Serial.print(dataToSend.Calc_deg_servo_1 / 100.0, 2); Serial.print(",");
        Serial.print(dataToSend.Calc_deg_servo_2 / 100.0, 2); Serial.print(",");
        Serial.print(dataToSend.yaw / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.rpm_prop_1 / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.rpm_prop_2 / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.battery_1 / 100.0, 2); Serial.print(",");
        // Serial.println(dataToSend.battery_2 / 100.0, 2);
        Serial.println(dataToSend.mode_auto);

        // ========== Send message via ESP-NOW ==========
        esp_err_t result = esp_now_send(user_side_Address, (uint8_t *) &dataToSend, sizeof(dataToSend));
        
        if (result == ESP_OK) {
          //Serial.println("Sent with success");
        }
        else {
          //Serial.println("Error sending the data");
        }

        // Serial.println(millis()/1000.000,3);
    } // end of if interval
}
